11/data/attachments/25a1734705f5ad4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Steven_price_Friend_22484_9</nif:username>
            <nif:friendToBeRequested>soap_friends_83b69bfa-14d6-4319-8bb0-2aa5560a6430</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>